Acquiring state lock. This may take a few moments...
module.lambda_layer.data.archive_file.pymysql_layer: Reading...
module.lambda_layer.data.archive_file.pymysql_layer: Read complete after 0s [id=fdbcd5e1107f297ea43bc9c2c8cf137dabe8d5aa]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0bb5747324e19debd]
module.subnet.aws_subnet.private_3b: Refreshing state... [id=subnet-0ff5567fa9ecb9eb8]
module.security_group.aws_security_group.app_sg: Refreshing state... [id=sg-0c4ab1b3ec86b031b]
module.subnet.aws_subnet.public_2c: Refreshing state... [id=subnet-044d7614d3865c27c]
module.subnet.aws_subnet.public_1a: Refreshing state... [id=subnet-0a813f171df83efab]
module.subnet.aws_subnet.private_4d: Refreshing state... [id=subnet-05027444faabd22d3]
module.security_group.aws_security_group.rds_sg: Refreshing state... [id=sg-0efd1cb63f8cdd7df]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=news-rds]
module.rds.aws_db_parameter_group.timezone: Refreshing state... [id=news-rds-timezone]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.crawler_schedule.aws_cloudwatch_event_rule.schedule_rule will be created
  + resource "aws_cloudwatch_event_rule" "schedule_rule" {
      + arn                 = (known after apply)
      + description         = "Crawler runs every hour"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "crawler-schedule-rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(50 0-23 ? * MON-FRI *)"
      + tags                = {
          + "Name" = "crawler-schedule-rule"
        }
      + tags_all            = {
          + "Name" = "crawler-schedule-rule"
        }
    }

  # module.crawler_schedule.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "crawler-schedule-rule"
      + target_id      = "crawler"
    }

  # module.crawler_schedule.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "news-crawler-lambda"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge-crawler-schedule-rule"
      + statement_id_prefix = (known after apply)
    }

  # module.docker_images.aws_lambda_function.news-crawler_mw will be created
  + resource "aws_lambda_function" "news-crawler_mw" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "news-crawler-lambda"
      + id                             = (known after apply)
      + image_uri                      = (sensitive value)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 180
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0efd1cb63f8cdd7df",
            ]
          + subnet_ids                  = [
              + "subnet-05027444faabd22d3",
              + "subnet-0ff5567fa9ecb9eb8",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # module.eks.aws_ecr_lifecycle_policy.spring_app will be created
  + resource "aws_ecr_lifecycle_policy" "spring_app" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images older than 1 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "spring-app"
    }

  # module.eks.aws_eks_cluster.this will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "news-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "news-cluster"
        }
      + tags_all                      = {
          + "Name" = "news-cluster"
        }
      + version                       = (known after apply)

      + access_config (known after apply)

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-044d7614d3865c27c",
              + "subnet-0a813f171df83efab",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.default will be created
  + resource "aws_eks_node_group" "default" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "news-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "news-cluster-ng"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-044d7614d3865c27c",
          + "subnet-0a813f171df83efab",
        ]
      + tags                   = {
          + "Name" = "news-cluster-ng"
        }
      + tags_all               = {
          + "Name" = "news-cluster-ng"
        }
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + remote_access {
          + ec2_ssh_key = "my-kp"
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + update_config (known after apply)
    }

  # module.iam.aws_iam_policy.lambda_policy will be created
  + resource "aws_iam_policy" "lambda_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lambda_sql_initializer_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "rds:DescribeDBInstances",
                          + "rds-data:ExecuteStatement",
                          + "rds-db:connect",
                          + "lambda:PublishLayerVersion",
                          + "lambda:Get*",
                          + "lambda:List*",
                          + "ses:SendEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_policy.lambda_vpc_access_policy will be created
  + resource "aws_iam_policy" "lambda_vpc_access_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lambda_vpc_access_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_role.eks_cluster_role will be created
  + resource "aws_iam_role" "eks_cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EKSClusterRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.eks_node_role will be created
  + resource "aws_iam_role" "eks_node_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EKSNodeInstanceRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda_sql_initializer_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.ec2_container_registry_read_only will be created
  + resource "aws_iam_role_policy_attachment" "ec2_container_registry_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "EKSNodeInstanceRole"
    }

  # module.iam.aws_iam_role_policy_attachment.eks_cluster_attach will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "EKSClusterRole"
    }

  # module.iam.aws_iam_role_policy_attachment.eks_cni will be created
  + resource "aws_iam_role_policy_attachment" "eks_cni" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "EKSNodeInstanceRole"
    }

  # module.iam.aws_iam_role_policy_attachment.eks_worker_node will be created
  + resource "aws_iam_role_policy_attachment" "eks_worker_node" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "EKSNodeInstanceRole"
    }

  # module.iam.aws_iam_role_policy_attachment.lambda_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_sql_initializer_role"
    }

  # module.iam.aws_iam_role_policy_attachment.lambda_vpc_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_vpc_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_sql_initializer_role"
    }

  # module.igw.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "team-igw"
        }
      + tags_all = {
          + "Name" = "team-igw"
        }
      + vpc_id   = "vpc-0bb5747324e19debd"
    }

  # module.lambda_layer.aws_lambda_layer_version.pymysql will be created
  + resource "aws_lambda_layer_version" "pymysql" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.11",
        ]
      + created_date                = (known after apply)
      + filename                    = "../../modules/lambda/layer/pymysql_layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "pymysql-layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "UsCtUjNZjqOdCFfzT/mVwAal45B1Mls0Ah7pwZx3abA="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.monitoring.aws_cloudwatch_dashboard.main will be created
  + resource "aws_cloudwatch_dashboard" "main" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/RDS",
                                  + "CPUUtilization",
                                  + "DBInstanceIdentifier",
                                  + "news-rds",
                                ],
                            ]
                          + period  = 300
                          + region  = "ap-northeast-2"
                          + stat    = "Average"
                          + title   = "RDS CPU 사용률"
                        }
                      + type       = "metric"
                      + width      = 8
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + logGroupNames = [
                              + "/aws/lambda/news-lambda-handler",
                            ]
                          + query         = "fields @timestamp, @message | filter @message like /실패/ | sort @timestamp desc | limit 20"
                          + region        = "ap-northeast-2"
                          + stacked       = false
                          + title         = "Lambda: MAIL_SEND_FAIL 로그"
                          + view          = "table"
                        }
                      + type       = "log"
                      + width      = 8
                      + x          = 8
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + logGroupNames = [
                              + "/aws/lambda/news-lambda-handler",
                            ]
                          + query         = "fields @timestamp, @message | filter @message like /성공/ | sort @timestamp desc | limit 20"
                          + region        = "ap-northeast-2"
                          + stacked       = false
                          + title         = "Lambda: MAIL_SEND_SUCCESS 로그"
                          + view          = "table"
                        }
                      + type       = "log"
                      + width      = 8
                      + x          = 8
                      + y          = 6
                    },
                ]
            }
        )
      + dashboard_name = "main-monitoring"
      + id             = (known after apply)
    }

  # module.monitoring.aws_cloudwatch_log_metric_filter.lambda_mail_fail will be created
  + resource "aws_cloudwatch_log_metric_filter" "lambda_mail_fail" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/news-lambda-handler"
      + name           = "lambda-mail-fail"
      + pattern        = "MAIL_SEND_FAIL"

      + metric_transformation {
          + name      = "MailSendFail"
          + namespace = "Lambda/Mail"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.mail_fail_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "mail_fail_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "MAIL_SEND_FAIL 로그가 감지됨"
      + alarm_name                            = "MailSendFailAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "MailSendFail"
      + namespace                             = "Lambda/Mail"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.rds_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "rds_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "RDS 인스턴스 CPU 70% 초과"
      + alarm_name                            = "RDS-CPU-High"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "news-rds"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 70
      + treat_missing_data                    = "missing"
    }

  # module.monitoring.aws_sns_topic.monitoring_alerts will be created
  + resource "aws_sns_topic" "monitoring_alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "monitoring-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.monitoring.aws_sns_topic_subscription.email["95eksldpf@gmail.com"] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "95eksldpf@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.monitoring.aws_sns_topic_subscription.email["jintonylove@gmail.com"] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "jintonylove@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.monitoring.aws_sns_topic_subscription.email["oosuoos@gmail.com"] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "oosuoos@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.monitoring.aws_sns_topic_subscription.email["skdurtlxx@gmail.com"] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "skdurtlxx@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.monitoring.aws_sns_topic_subscription.email["sunyj1225@gmail.com"] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "sunyj1225@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.nat.aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # module.nat.aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0a813f171df83efab"
      + tags                               = {
          + "Name" = "nat-gateway"
        }
      + tags_all                           = {
          + "Name" = "nat-gateway"
        }
    }

  # module.rds.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "NewsSubscribe"
      + db_subnet_group_name                  = "news-rds"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "news-rds"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "news-rds-timezone"
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "news-rds"
        }
      + tags_all                              = {
          + "Name" = "news-rds"
        }
      + timezone                              = (known after apply)
      + username                              = "root"
      + vpc_security_group_ids                = [
          + "sg-0efd1cb63f8cdd7df",
        ]
    }

  # module.route.aws_route.private_route will be created
  + resource "aws_route" "private_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.route.aws_route.public_route will be created
  + resource "aws_route" "public_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.route.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "private-route-table"
        }
      + tags_all         = {
          + "Name" = "private-route-table"
        }
      + vpc_id           = "vpc-0bb5747324e19debd"
    }

  # module.route.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "public-route-table"
        }
      + tags_all         = {
          + "Name" = "public-route-table"
        }
      + vpc_id           = "vpc-0bb5747324e19debd"
    }

  # module.route.aws_route_table_association.private_1 will be created
  + resource "aws_route_table_association" "private_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0ff5567fa9ecb9eb8"
    }

  # module.route.aws_route_table_association.private_2 will be created
  + resource "aws_route_table_association" "private_2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-05027444faabd22d3"
    }

  # module.route.aws_route_table_association.public_1 will be created
  + resource "aws_route_table_association" "public_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0a813f171df83efab"
    }

  # module.route.aws_route_table_association.public_2 will be created
  + resource "aws_route_table_association" "public_2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-044d7614d3865c27c"
    }

  # module.sending_news.data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/sending_news/lambda_function.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "../../modules/lambda/sending_news/lambda_function.py"
      + type                = "zip"
    }

  # module.sending_news.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/lambda/sending_news/lambda_function.zip"
      + function_name                  = "news-lambda-handler"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0c4ab1b3ec86b031b",
            ]
          + subnet_ids                  = [
              + "subnet-05027444faabd22d3",
              + "subnet-0ff5567fa9ecb9eb8",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # module.sending_news_schedule.aws_cloudwatch_event_rule.schedule_rule will be created
  + resource "aws_cloudwatch_event_rule" "schedule_rule" {
      + arn                 = (known after apply)
      + description         = "Send news weekdays at 9AM"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "sending-news-schedule-rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 * ? * MON-FRI *)"
      + tags                = {
          + "Name" = "sending-news-schedule-rule"
        }
      + tags_all            = {
          + "Name" = "sending-news-schedule-rule"
        }
    }

  # module.sending_news_schedule.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "sending-news-schedule-rule"
      + target_id      = "sending-news"
    }

  # module.sending_news_schedule.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "news-lambda-handler"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge-sending-news-schedule-rule"
      + statement_id_prefix = (known after apply)
    }

  # module.sql_initializer.data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/sql_initializer/sql_init.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/lambda/sql_initializer"
      + type                = "zip"
    }

  # module.sql_initializer.aws_lambda_function.sql_initializer will be created
  + resource "aws_lambda_function" "sql_initializer" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/lambda/sql_initializer/sql_init.zip"
      + function_name                  = "rds-sql-initializer"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0c4ab1b3ec86b031b",
            ]
          + subnet_ids                  = [
              + "subnet-05027444faabd22d3",
              + "subnet-0ff5567fa9ecb9eb8",
            ]
          + vpc_id                      = (known after apply)
        }
    }

Plan: 46 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "db_password" but a value
was found in file "terraform.auto.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

<!-- Sticky Pull Request Comment -->